{
    "es":[
        {
            "bandera": "https://fct.dawidpelc.com/MDFitness/public/imatges/aliments/aliment_1649152807.png",
            "inici": "Inicio",
            "restaurants": "Restaurantes",
            "diari": "Diario",
            "iniciarsessio": "Iniciar Sesión",
            "registrarse": "Registrarse",
            "tancarsessio": "Cerrar Sesión",
            "informacio": "Información",
            "perfil": "Perfil",
            "contribuir": "Contribuir",

            "clta": "CUIDA TU ALIMENTACIÓN",
            "intro": "Lineal Food es un proyecto enfocado a las personas que quieren cuidar su alimentación y ser más conscientes de los alimentos que ingieren. Con nuestra aplicación puedes consultar la información nutricional detallada de los alimentos que ingieres, crear recetas personalizadas y registrar todo el que ingieres diariamente creando una cuenta y accediendo al diario.",
            "av": "ALIMENTACIÓN VARIADA",
            "avtxt": "Una dieta equilibrada no solo se trata de comer alimentos saludables. También es necesario variar y alternar entre los alimentos que ingerimos, alcanzando todos los grupos de alimentos que existen, como la carne, huevos, peces, lácteos, frutas, verduras, legumbres... Todos ellos su necesarios para proporcionar nutrientes en el cuerpo.",
            "cetc": "CUIDA TU CORAZÓN",
            "cetctxt": "Si bien puede ser que sepas que comer determinados alimentos puede aumentar tu riesgo de enfermedad cardíaca, cambiar tus costumbres alimenticias suele ser difícil. Ya sea que lleves años comiendo de forma poco saludable o simplemente quieras ajustar las roscas de tu dieta. Una vez que sepas qué alimentos tienes que comer más y qué tienes que limitar, estarás camino a una dieta saludable para el coro. Estás a tiempo de hacer un gran cambio.",

            "calories": "Calorías",
            "cpm": "Haz click para más",
            "greixos": "Grasas",
            "gt": "Grasas Totales",
            "hidrats": "Hidratos",
            "hdc": "Hidratos de carbono",
            "proteïnes": "Proteínas",
            "sucre": "Azúcar",
            "sodi": "Sodio",
            "fibra": "Fibra",
            "energia": "Energía",
            "dqs": "De los cuales, azúcares",
            "inp": "Información nutricional por",
            "grams": "gramos",
            "porcio": "porción/es",

            "mi": "Mi información",
            "nl": "Nombre y apellidos",
            "ce": "Correo electrónico",
            "dni": "DNI",
            "telefon": "Teléfono",
            "dcpp": "Dirección (calle, piso y puerta)",
            "desar": "Guardar cambios",
            "cancelar": "Cancelar",
            "idiomafav": "Idioma preferido",
            "reset": "Restablecer contraseña",
            "reset2": "Contraseña",
            "df": "Establecer objetivo de alimentación",
            "nivellactivitat": "Nivel de actividad física",
            "objectiu": "Objetivo",
            "consumir": "Consumir",
            "altura": "Altura (cm)",
            "peso": "Peso (kg)",
            "edad": "Edad",
            "sexo": "Sexo",
            "home": "Hombre",
            "dona": "Mujer",
            "finalcalories": "Para lograr tu objetivo, diariamente deberías consumir ",

            "nullaltura": "Debes especificar tu altura",
            "nullpes": "Debes especificar tu peso",
            "nulledat": "Debes especificar tu edad",
            "nullsexe": "Debes especificar tu sexo",

            "faltendades": "Rellena los campos anteriores para conocer tu recomendación de calorías",

            "menjar1": "Desayuno",
            "menjar2": "Comida",
            "menjar3": "Merienda",
            "menjar4": "Cena",

            "recomanades": "recomendadas",
            "consumides": "consumidas",
            "restants": "restantes",
            "sub1": "consumo de calorías",
            "afegint": "Añadiendo",
            "quantitat": "Cantidad",

            "rlc": "Rellene los campos según las indicaciones",
            "auna": "Sugerir un nuevo alimento para nuestra base de datos",
            "politica": "Todos los alimentos sugeridos seran revisados por uno de nuestros administradores. Este analizará los datos y decidirá si añadirlo a la base de datos. También podrá realizar cambios en la información recibida si es necesario. Si el alimento se decide añadir a la base de datos estará visible para todos los usuarios.",
            "dai": "Indique el nombre del alimento en los tres idiomas solicitados. Ej: Pechuga de Pollo, Pit de Pollastre, Chicken Breast. En caso de que el alimento esté en un idioma en concreto o no deba traducirse, rellene los tres campos con el mismo nombre, o según crea adecuado.",
            "es": "Español",
            "ca": "Catalán",
            "en": "Inglés",
            "inc100g": "Especifique la cantidad (gramos) de cada nutriente por cada 100 gramos de producto, dejando en blanco los campos que desconozca. Si los valores son decimales, use el punto en lugar de la coma.",
            "imatgepng": "Puede subir una imagen (preferiblemente sin fondo o PNG), o especificar una URL de internet. Nuestros administradores se encargarán de subirla a nuestra base de datos",
            "url": "Especificar una URL",
            "subir": "Subir una foto",
            "gp": "Tamaño de la porción (gramos). Dejar en blanco si es desconocido o no corresponde",
            "imgaliment": "Imagen del alimento",
            "debsed": "dejar en blanco si es desconocido",
            "wit": "Qué es esto?",
            "marcarestaurant": "Marca/Restaurante (Opcional)",
            "ns": "No especificado",
            "enviarproposta": "Enviar Propuesta",
            "tipusaliment": "Tipo de alimento",
            "gptc": "Gracias por tu colaboración",
            "serarevisat": "Tu aportación será revisada por nuestros administradores antes de ser añadida a la base de datos si esta nos parece correcta. Con tu ayuda podemos crear una base de datos mayor y formar una aplicación más completa.",
            "hoa": "Hacer otra aportación",
            "contribuidor": "Introduce tu nombre si quieres aparecer como contribuidor de la base de datos",
            "inseritper": "Los datos de este alimento fueron aportaos por",
            "sensecontribuidor": "Este alimento fue creado por un administrador",
            "pdc": "Panel de Control",
            "nomaliment": "Nombre del alimento",
            "fotografia": "Imagen",
            "gramsporcio": "Porción",
            "aprovaraliment": "Aprobar",
            "reprovaraliment": "Denegar",
            "contribuidor": "Contribuidor",
            "titulopanel": "Bienvenido al panel de control",
            "descripcionpanel": "En este panel puedes ver las solicitudes de alimentos nuevos sugeridos por los usuarios. Puedes aprobar las peticiones que veas correctas, denegar las que no, y modificar las que veas necesarias. También puedes modificar datos de los alimentos ya existentes en la base de datos si existe algún fallo o hay que eliminar un alimento.",
            "marcarestaurantC": "Marca/Restaurante",
            "nhhc": "No hay solicitudes nuevas esperando a ser aprobadas ahora mismo, vuelve más tarde",
            "etpshm": "Tu perfil ha sido modificado",
            "canvisguardats": "Cambios guardados",
            "sesini": "Sesión iniciada correctamente",
            "volsinises": "Quieres iniciar sesión ahora?",
            "registrefet": "Te has registrado correctamente",
            "notnow": "Ahora no",
            "ytkmh": "Sí, llévame ahí!",
            "duplicateemail1": "No se pudo registrar",
            "duplicateemail2": "Ya existe un usuario con este correo",
            "nshpis": "Lo sentimos, no se ha podido iniciar sesión :(",
            "upfail": "Comprueba que el usuario y contraseña son correctos",
            "hola": "Bienvenido de nuevo!",
            "errordesconegut": "Error desconocido",
            "torniaintentarho": "Vuelva a intentarlo",
            "espera1m": "Espera un momento!",
            "estassegur": "Estás seguro de que quieres cerrar sesión?",
            "si": "Sí, cerrar sesión",
            "no": "No, mantener mi sesión iniciada",
            "cua": "Buscar un alimento...",
            "objectiu_noes1": "No has establecido tu objetivo",
            "objectiu_noes2": "Hazlo en el apartado perfil",
            "nspaea": "No s'ha pogut guardar l'aliment",
            "npadaamm": "No pots registrar el mateix aliment dues vegades un mateix menjar del dia",
            "thp": "T'has passat'!",
            "hcmcdlc": "Avui has ingerit massa calories",
            "thp": "Te has pasado!",
            "hcmcdlc": "Hoy has ingerido demasiadas calorías",
            "dadespersonals": "Datos personales",
            "alimentsfavorits": "Alimentos favoritos",
            "receptes": "Recetas guardadas",
            "eliminardf": "Eliminar de favoritos",
            "notensfavs": "No tienes ningún alimento favorito! Cuando tengas, aparecerán aquí!",
            "marcaaliment": "Marca",
            "favs": "Favorito",
            "save": "Guardar",
            "aaf": "Añadir a favoritos",
            "edf": "Eliminar de favoritos",
            "enis": "Es necesario iniciar sesión para realizar esta acción",
            "sehaafegit": "Se ha añadido",
            "aetaf": "a tus alimentos favoritos",
            "uuuaaa": "Puedes ver todos tus alimentos favoritos accediendo al apartado Perfil > Alimentos favoritos",
            "denegarsolicitud1": "Está seguro de que quiere denegar esta solicitud?",
            "denegarsolicitud2": "Los datos sugeridos por el contribuidor se perderán",
            "eliminaraliment1": "Está seguro de que quiere eliminar este alimento?",
            "eliminaraliment2": "Los datos del alimento se eliminarán de la base de datos",
            "modificardadesaliment1": "Quiere guardar los cambios?",
            "modificardadesaliment2": "Las modificaciones se veran reflejadas en la base de datos",
            "siadelante": "Sí, adelante",
            "sidenegar": "Si, denegar los datos",
            "nodenegar": "No, espera",
            "sieliminar": "Sí, eliminar alimento",
            "noeliminar": "No, espera",
            "aceptarsolicitud1": "Está seguro de que quiere aceptar la solicitud?",
            "aceptarsolicitud2": "Los datos del alimento serán visibles para todos los usuarios",
            "siaceptar": "Sí, aceptar solicitud",
            "noaceptar": "No, espera",
            "llistataliments": "Listado de alimentos",
            "descllistaaliments": "Bienvenido al listado de todos nuestros alimentos. Aquí puedes aplicar diferentes filtros a nuestro listado, como ver alimentos de un tipo concreto o ordenar de mayor a menor según algún nutriente",
            "filtrealfabet": "Filtrar por orden alfabético",
            "filtrealfabetcontrari": "Filtrar al contrario del orden alfabético",
            "filtretipus": "Filtrar por tipo de alimento",
            "filtrerestaurant": "Filtrar por marca o restaurante",
            "filtrecalories": "Filtrar por calorías",
            "filtregreixos": "Filtrar por grasas",
            "filtrehidrats": "Filtrar por hidratos",
            "filtreproteines": "Filtrar por proteínas",
            "demajoramenor": "Mayor a menor",
            "demenoramajor": "Menor a mayor",
            "lainfoesper100g": "* Los filtros hacen referencia a la información nutricional por cada 100 gramos de producto",
            "receptavacia": "Esta receta está vacía",
            "quisom": "Quién somos?",
            "paragrafQuiSom": "Somos dos jóvenes alumnos del Pau Casesnoves CIFP, estudiantes de Desarrollo de Aplicaciones Web, que estamos realizando nuestro proyecto final para el curso 2021-2022. Actualmente, estamos haciendo las prácticas en la empresa Gamadi Consulting Balears S.L. en Palma de Mallorca. Tenemos grandes aspiraciones de cara al futuro y muchas ganas de comenzar a trabajar en el mundo del desarrollo web.",
            "afegiraliment": "Añadir alimento a la receta",
            "crearnovarecepta": "Crear una nueva receta",
            "nomrecepta": "Nombre de la receta",
            "descripciorecepta": "Descripción de la receta",
            "imatgerepresentativarecepta": "Imagen representativa de la receta",
            "confnuerec": "Confirmar nueva receta",
            "eliminarrecepta": "Eliminar receta",
            "estassegur2": "Estás seguro de que quieres eliminar la receta?",
            "sieliminarreceta": "Sí, eliminar la receta",
            "afegiradiari": "Añadir a mi diario",
            "recetagefida1": "Se ha añadido ",
            "recetagefida2": " a tu diario",
            "qaatda": "Quieres acceder a tu diario ahora?",
            "infoproteines": "Las proteínas desempeñan un papel fundamental en el organismo. Son esenciales para el crecimiento, gracias a su contenido de nitrógeno y suponen aproximadamente la mitad del peso de los tejidos del organismo, estando presentes en todas las células del cuerpo, además de participar en prácticamente todos los procesos biológicos que se producen. Están presentes sobre todo en los alimentos de origen animal como la carne, el pescado, los huevos y la leche. Pero también lo están en alimentos vegetales, como la soja, las legumbres y los cereales, aunque en menor proporción. Su ingesta aporta al organismo 4 kilocalorías por cada gramo de proteína.",
            "infohidrats": "Los carbohidratos, también llamados hidratos de carbono, son los azúcares, almidones y fibras que se encuentran en una gran variedad de alimentos como frutas, granos, verduras y productos lácteos. Se llaman hidratos de carbono, ya que a nivel químico contienen carbono, hidrógeno y oxígeno. Son uno de los grupos alimenticios básicos y son importantes para llevar una vida saludable, puesto que son macronutrientes, lo que significa que son una de las tres formas principales de sustancias que usa el cuerpo humano para obtener energía o calorías. Todos los macronutrientes se deben de obtener de la dieta, pues el cuerpo no puede producirlos por sí solo.",
            "infogreixos": "Las grasas son un tipo de nutriente que se obtiene de la alimentación. Es esencial comer algunas grasas, aunque también es dañino comer demasiado. Las grasas que consumimos le dan al cuerpo la energía que necesita para trabajar adecuadamente. Durante el ejercicio, el cuerpo utiliza las calorías de los carbohidratos que hemos consumido. Pero después de 20 minutos, el ejercicio depende en parte de las calorías provenientes de la grasa para continuar. También necesitamos grasa para mantener la piel y el cabello saludables. Alimentos ricos en grasas saludables son el aceite de oliva virgen extra, el aguacate, el pescado azul, los frutos secos, entre muchos otros.",
            "socialmedia": "Redes Sociales",
            "tornaraintentar": "Volver a intentarlo",
            "perfildawid1": "Nacido en Kłodzko, Polonia, el 8 de octubre de 2002, es un joven programador experimentado en React, Laravel y Javascript. En su tiempo libre le gusta realizar actividad física y ver el fútbol, siempre que no está programando. Estudia actualmente el grado superior de desarrollo de aplicaciones web en el CIFP Pau Casesnoves en Inca, Mallorca.",
            "eliminaraliment": "Eliminar",
            "editaraliment": "Guardar",
            "adelbdd": "Alimentos disponibles en la base de datos",
            "sdlupa": "Solicitudes de los usuarios",
            "tsdaea": "¿Sabes qué tienen en común estos alimentos?",
            "alimentsferro": "Todos ellos son alimentos ricos en hierro, el cual se encuentra entre los elementos más importantes para el buen funcionamiento de nuestro cuerpo. Este mineral cumple con dos trabajos esenciales: ayudar al oxígeno a recorrer el cuerpo y contribuir a que siempre haya una buena producción de glóbulos rojos. Tienen gran importancia en el aporte de oxígeno a todas nuestras células. Es necesario saber entonces cuáles son los alimentos ricos en hierro. Así podrán incluirse en la dieta hasta alcanzar los 18 miligramos que se recomiendan por día. Alimentos ricos en hierro son los pistachos, las espinacas, almendras, avena, el chocolate, los huevos, el brócoli, las almendras.",
            "loading": "Cargando, por favor espere...",
            "queteapetece": "Qué te apetece comer?",
            "notienescuenta": "No tienes cuenta?",
            "registrate": "Regístrate",
            "arrowup": "Volver a los filtros",
            "hhueiea": "Ha habido un error",
            "varlcdf": "Vuelva a revisar los campos",
            "perfilmateu1": "Nacido en Palma de Mallorca, el 23 de abril del 2002, es un chico con motivación para lo que le espera a lo largo de su vida. Tiene una gran habilidad para diseñar estilos de páginas web. Aparte de la programación, también le apasiona el deporte como el básquet o el gimnasio. En su tiempo libre le gusta estar en la naturaleza, haciendo excursiones por la montaña o por el campo.",
            "calroies10dies": "Calorías consumidas en los últimos 10 días registrados"
        }
    ],
    "ca":[
        {
            "bandera": "https://fct.dawidpelc.com/MDFitness/public/imatges/aliments/aliment_1649152793.png",
            "inici": "Inici",
            "restaurants": "Restaurants",
            "diari": "Diari",
            "iniciarsessio": "Iniciar Sessó",
            "registrarse": "Registrar-se",
            "tancarsessio": "Tancar Sessió",
            "informacio": "Informació",
            "perfil": "Perfil",
            "contribuir": "Contribuïr",

            "clta": "CUIDA LA TEVA ALIMENTACIÓ",
            "intro": "Lineal Food és un projecte enfocat a les persones que volen cuidar la seva alimentació i ser més conscients dels aliments que ingereixen. Amb la nostra aplicació pots consultar la informació nutricional detallada dels aliments que ingereixes, crear receptes personalitzades i registrar tot el que ingereixes diàriament creant un compte i accedint al diari.",
            "av": "ALIMENTACIÓ VARIADA",
            "avtxt": "Una dieta equilibrada no sols es tracta de menjar aliments saludables. També és necessari variar i alternar entre els aliments que ingerim, abastant tots els grups d'aliments que existeixen, com la carn, ous, peixos, lactis, fruites, verdures, llegums... Tots ells son necessaris per proporcionar nutrients al cos.",
            "cetc": "CUIDA EL TEU COR",
            "cetctxt": "Si bé pot ser que sàpigues que menjar determinats aliments pot augmentar el teu risc de malaltia cardíaca, canviar els teus costums alimentosos sol ser difícil. Ja sigui que portis anys menjant de forma poc saludable o simplement vulguis ajustar les rosques de la teva dieta. Una vegada que sàpigues quins aliments has de menjar més i quins has de limitar, estaràs camí a una dieta saludable per al cor. Estás a temps de fer un gran canvi.",

            "calories": "Calories",
            "cpm": "Fes clic para más",
            "greixos": "Greixos",
            "gt": "Greixos Totals",
            "hidrats": "Hidrats",
            "hdc": "Hidrats de carboni",
            "proteïnes": "Proteïnes",
            "sucre": "Sucre",
            "sodi": "Sodi",
            "fibra": "Fibra",
            "energia": "Energia",
            "dqs": "Dels quals, sucres",
            "inp": "Informació nutricional per",
            "grams": "grams",
            "porcio": "porció/ns",
        
            "mi": "La meva informació",
            "nl": "Nom i llinatges",
            "ce": "Correu electrònic",
            "dni": "DNI",
            "telefon": "Telèfon",
            "dcpp": "Adreça (carrer, pis i porta)",
            "desar": "Desar canvis",
            "cancelar": "Cancel·lar",
            "idiomafav": "Idioma preferit",
            "reset": "Reestablir contraseña",
            "reset2": "Contrasenya",
            "df": "Establir objetiu d'alimentació",
            "nivellactivitat": "Nivell d'activitat física",
            "objectiu": "Objectiu",
            "consumir": "Consumir",
            "altura": "Altura (cm)",
            "peso": "Pes (kg)",
            "edad": "Edat",
            "sexo": "Sexe",
            "home": "Home",
            "dona": "Dona",
            "finalcalories": "Per lograr el teu objectiu, diàriament hauries de consumir ",

            "nullaltura": "Has d'especificar la teva altura",
            "nullpes": "Has d'especificar el teu pes",
            "nulledat": "Has d'especificar la teva edat",
            "nullsexe": "Has d'especificar el teu sexe",

            "faltendades": "Emplena els camps anteriors per conèixer la teva recomanació de calories",

            "menjar1": "Esmorzar",
            "menjar2": "Dinar",
            "menjar3": "Berenar",
            "menjar4": "Sopar",

            "recomanades": "recomanades",
            "consumides": "consumides",
            "restants": "restants",
            "sub1": "consum de caloríes",
            "afegint": "Afegint",
            "quantitat": "Quantitat",

            "rlc": "Empleni els camps segons les indicacions",
            "auna": "Sugerir un nou aliment per la nostra base de dades",
            "politica": "Tots els aliments suggerits seran revisats per un dels nostres administradors. Aquest analitzarà les dades i decidirà si afegir-ho a la base de dades. També podrà fer canvis en la informació rebuda si és necessari. Si l'aliment es decideix afegir a la base de dades estarà visible per a tots els usuaris.",
            "dai": "Indiqui el nom de l'aliment en els tres idiomes sol·licitats. Ex: Pechuga de pollo, Pit de pollastre, Chicken Breast. En cas que l'aliment estigui en un idioma en concret o no hagi de traduir-se, empleni els tres camps amb el mateix nom, o segons trobi adequat.",
            "es": "Espanyol",
            "ca": "Català",
            "en": "Anglès",
            "inc100g": "Especifiqui la quantitat (grams) de cada nutrient per cada 100 grams de producte, deixant en blanc els camps que desconegui. Si els valors contenen decimals, empri el punt en lloc de la coma.",
            "imatgepng": "Pots pujar una imatge (preferiblement sense fons o PNG), o especificar una URL de internet. Els nostres administradors s'encarregaran de pujar-la a la base de dades",
            "url": "Especificar una URL",
            "subir": "Pujar una foto",
            "gp": "Tamany de la porció (grams). Deixar en blanc si es desconeix o no correspon",
            "imgaliment": "Imatge de l'aliment",
            "debsed": "deixar en blanc si és desconegut",
            "wit": "Què és això?",
            "marcarestaurant": "Marca/Restaurant (Opcional)",
            "ns": "No especificat",
            "enviarproposta": "Enviar Proposta",
            "tipusaliment": "Tipus d'aliment",
            "gptc": "Gràcies per la teva col·laboració",
            "serarevisat": "La teva aportació serà revisada per els nostres administradors abans de ser afegida a la base de dades, si aquesta ens sembla correcta. Amb la teva ajuda podem crear una base de dades més gran i formar una aplicació més completa.",
            "hoa": "Fer una altra aportació",
            "contribuidor": "Introdueix el teu nom si vols aparèixer com a contribuidor de la base de dades",
            "inseritper": "Les dades d'aquest aliment varen estar aportades per en/na",
            "sensecontribuidor": "Aquest aliment va estar creat per un administrador",
            "pdc": "Panell de Control",
            "nomaliment": "Nom",
            "fotografia": "Imatge",
            "gramsporcio": "Porció",
            "aprovaraliment": "Aprovar",
            "reprovaraliment": "Denegar",
            "contribuidor": "Contribuïdor",
            "titulopanel": "Benvinguts al panell de control",
            "descripcionpanel": "En aquest panell pots veure les sol·licituds d'aliments nous suggerits pels usuaris. Pots aprovar les peticions que vegis correctes, denegar les que no, i modificar les que vegis necessàries. També pots modificar dades dels aliments ja existents en la base de dades si existeix alguna fallada o cal eliminar un aliment.",
            "marcarestaurantC": "Marca/Restaurant",
            "nhhc": "No hi ha noves socicituds esperant a ser aprovades ara mateix, torna més tard",
            "etpshm": "El teu perfil s'ha modificat",
            "canvisguardats": "Canvis guardats",
            "sesini": "Sessió iniciada correctament",
            "volsinises": "Vols iniciar sessió ara?",
            "registrefet": "T'has registrat correctament",
            "notnow": "Ara no",
            "ytkmh": "Si, porta'm allá!",
            "duplicateemail1": "No s'ha pogut registrar",
            "duplicateemail2": "Ja existeix un usuari amb aquest correu",
            "nshpis": "Ho sentim, no s'ha pogut iniciar sessió :(",
            "upfail": "Comprova que l'usuari i conntrasenya son correctes",
            "hola": "Benvingut de nou!",
            "errordesconegut": "Error desconegut",
            "torniaintentarho": "Torni a intentar-ho",
            "espera1m": "Espera un moment!",
            "estassegur": "Estàs segur que vols tancat sessió?",
            "si": "Sí, tancar sessió",
            "no": "No, mantenir la sessió iniciada",
            "cua": "Cerca un aliment...",
            "objectiu_noes1": "No ha establert cap objectiu",
            "objectiu_noes2": "Fes-ho a l'apartat de perfil",
            "nspaea": "No se ha podido guardar el alimento",
            "npadaamm": "No puedes registrar el mismo alimento dos veces en una misma comida del día",
            "thp": "T'has passat'!",
            "hcmcdlc": "Avui has ingerit massa calories",
            "dadespersonals": "Dades personals",
            "alimentsfavorits": "Aliments favorits",
            "receptes": "Receptes guardades",
            "eliminardf": "Eliminar de favorits",
            "notensfavs": "No tens cap aliment favorit! Quan en tenguis, apareixeran aquí.",
            "marcaaliment": "Marca",
            "favs": "Favorit",
            "save": "Guardar",
            "aaf": "Afegir a favorits",
            "edf": "Eliminar de favorits",
            "enis": "És necessari iniciar sessió per realitzar aquesta acció",
            "sehaafegit": "S'ha afegit",
            "aetaf": "als teus aliments favorits",
            "uuuaaa": "Pots veure tots els teus aliments favorits accedint a l'apartat Perfil > Aliments favorits",
            "denegarsolicitud1": "Està segur que vol denegar aquesta sol·licitud?",
            "denegarsolicitud2": "Les dades de l'aliment s'eliminaran de la base de dades",
            "eliminaraliment1": "Estàs segur que vols eliminar l'aliment?",
            "eliminaraliment2": "Les dades de l'aliment s'eliminaran de la base de dades",
            "modificardadesaliment1": "Vols guardar els canvis?",
            "modificardadesaliment2": "Les modificacions es veuran reflectides a la base de dades",
            "siadelante": "Si, endevant",
            "sidenegar": "Si, denegar les dades",
            "nodenegar": "No, espera",
            "sieliminar": "Sí, eliminar aliment",
            "noeliminar": "No, espera",
            "aceptarsolicitud1": "Está segur que vol acceptar la sol·licitud?",
            "aceptarsolicitud2": "Les dades de l'aliment seran visibles per tots els usuaris",
            "siaceptar": "Sí, acceptar sol·licitud",
            "noaceptar": "No, espera",
            "llistataliments": "Llistat d'aliments",
            "descllistaaliments": "Benvingut al llistat de tots els nostres aliments. Aquí pots aplicar diferents filtres al nostre llistat, com veure aliments d'un tipus concret o ordenar de major a menor segons algun nutrient",
            "filtrealfabet": "Filtrar por ordre alfabètic",
            "filtrealfabetcontrari": "Filtrar en sentit contrari a l'ordre alfabètic",
            "filtretipus": "Filtrar per tipus d'aliment",
            "filtrerestaurant": "Filtrar per marca o restaurant",
            "filtrecalories": "Filtrar per calories",
            "filtregreixos": "Filtrar per greixos",
            "filtrehidrats": "Filtrar per hidrats",
            "filtreproteines": "Filtrar per proteïnas",
            "demajoramenor": "Major a menor",
            "demenoramajor": "Menor a major",
            "lainfoesper100g": "* Els filtres fan referència a la informació nutricional per cada 100 grams de producte",
            "receptavacia": "Aquesta recepta está vacía",
            "quisom": "Qui som?",
            "paragrafQuiSom": "Somos dos jóvenes alumnos del Pau Casesnoves CIFP, estudiantes de Desarrollo de Aplicaciones Web, que estamos realizando nuestro proyecto final para el curso 2021-2022. Actualmente, estamos haciendo las prácticas en la empresa Gamadi Consulting Balears S.L. en Palma de Mallorca. Tenemos grandes aspiraciones de cara al futuro y muchas ganas de comenzar a trabajar en el mundo del desarrollo web.",
            "afegiraliment": "Afegir aliment a la recepta",
            "crearnovarecepta": "Crear una nova recepta",
            "nomrecepta": "Nom de la recepta",
            "descripciorecepta": "Descripció de la recepta",
            "imatgerepresentativarecepta": "Imatge representativa de la recepta",
            "confnuerec": "Confirmar nova recepta",
            "eliminarrecepta": "Eliminar recepta",
            "estassegur2": "Estás segur que vols eliminar la recepte?",
            "sieliminarreceta": "Si, eliminar la recepta",
            "afegiradiari": "Afegir al meu diari",
            "recetagefida1": "S'ha afegit ",
            "recetagefida2": " al teu diari",
            "infoproteines": "Les proteïnes exerceixen un paper fonamental en l'organisme. Són essencials per al creixement, gràcies al seu contingut de nitrogen i suposen aproximadament la meitat del pes dels teixits de l'organisme, sent presents en totes les cèl·lules del cos, a més de participar en pràcticament tots els processos biològics que es produeixen. Són presents sobretot en els aliments d'origen animal com la carn, el peix, els ous i la llet. Però també ho estan en aliments vegetals, com la soia, els llegums i els cereals, encara que en menor proporció. La seva ingesta aporta a l'organisme 4 quilocalories per cada gram de proteïna.",
            "infohidrats": "Els carbohidrats, també anomenats hidrats de carboni, són els sucres, midons i fibres que es troben en una gran varietat d'aliments com a fruites, grans, verdures i productes lactis. Es diuen hidrats de carboni, ja que a nivell químic contenen carboni, hidrogen i oxigen. Són un dels grups alimentosos bàsics i són importants per a portar una vida saludable, ja que són macronutrients, cosa que significa que són una de les tres formes principals de substàncies que usa el cos humà per a obtenir energia o calories. Tots els macronutrients s'han d'obtenir de la dieta, perquè el cos no pot produir-los per si sol.",
            "infogreixos": "Els greixos són un tipus de nutrient que s'obté de l'alimentació. És essencial menjar alguns greixos, encara que també és nociu menjar massa. Els greixos que consumim li donen al cos l'energia que necessita per a treballar adequadament. Durant l'exercici, el cos utilitza les calories dels carbohidrats que hem consumit. Però després de 20 minutos, l'exercici depèn en part de les calories provinents del greix per a continuar. També necessitem greix per a mantenir la pell i el cabell saludables. Aliments rics en greixos saludables són l'oli d'oliva verge extra, l'alvocat, el peix blau, la fruita seca, entre molts altres.",
            "socialmedia": "Xarxes Socials",
            "tornaraintentar": "Tornar a intentar-ho",
            "perfildawid1": "Nascut a Kłodzko, Polònia, el 8 d'octubre del 2002, és un jove programador experimentat a React, Laravel i Javascript. En el seu temps lliure li agrada fer activitat física i veure el futbol, ​​sempre que no està programant. Estudia actualment el grau superior de desenvolupament d'aplicacions web al CIFP Pau Casesnoves a Inca, Mallorca.",
            "eliminaraliment": "Eliminar",
            "editaraliment": "Guardar",
            "adelbdd": "Aliments disponibles a la base de dades",
            "sdlupa": "Sol·licituds dels usuaris",
            "tsdaea": "Saps què tenen en comú aquests aliments?",
            "alimentsferro": "Tots ells són aliments rics en ferro, el qual es troba entre els elements més importants per al bon funcionament del nostre cos. Aquest mineral compleix amb dos treballs essencials: ajudar l'oxigen a recórrer el cos i contribuir al fet que sempre hi hagi una bona producció de glòbuls vermells. Tenen gran importància en l'aportació d'oxigen a totes les nostres cèl·lules. És necessari saber llavors quins són els aliments rics en ferro. Així podran incloure's en la dieta fins a aconseguir els 18 mil·ligrams que es recomanen per dia. Aliments rics en ferro són els festucs, els espinacs, ametlles, civada, la xocolata, els ous, el bròcoli, les ametlles.",
            "loading": "Carregant, per favor esperi...",
            "queteapetece": "Què et fa ganes menjar?",
            "notienescuenta": "No tens compte?",
            "registrate": "Regístra't",
            "arrowup": "Tornar als filtres",
            "hhueiea": "Hi ha hagut un error",
            "varlcdf": "Torni a revisar els camps",
            "perfilmateu1": "Nascut a Palma de Mallorca, el 23 d'abril del 2002, és un noi amb motivació pel que espera al llarg de la seva vida. Té una gran habilitat per dissenyar estils de pàgines web. A banda de la programació, també us apassiona l'esport com el bàsquet o el gimnàs. En el seu temps lliure li agrada estar a la natura, fent excursions per la muntanya o pel camp.",
            "calroies10dies": "Calories ingerides en els darrers 10 dies registrats"
        }
    ],
    "en":[
        {
            "bandera": "https://fct.dawidpelc.com/MDFitness/public/imatges/aliments/aliment_1649152757.png",
            "inici": "Home",
            "restaurants": "Restaurants",
            "diari": "Diary",
            "iniciarsessio": "Login",
            "registrarse": "Register",
            "tancarsessio": "Log Out",
            "informacio": "Info",
            "perfil": "Profile",
            "contribuir": "Contribute",

            "clta": "TAKE CARE OF TOUR DIET",
            "intro": "Lineal Food is a project aimed at people who want to look after their food and be more aware of the food they eat. With our application you can check the detailed nutritional information of the food you eat, create custom recipes and record everything you ingest daily by creating an account and accessing the journal.",
            "av": "VARIED DIET",
            "avtxt": "A balanced diet is not only about eating healthy food. It is also necessary to vary and alternate between the food we eat, covering all the food groups that exist, such as meat, eggs, fish, milk, fruit, vegetables, legumes... All of them are necessary to provide nutrients to the body.",
            "cetc": "TAKE CARE OF YOUR HEART",
            "cetctxt": "While you may know that eating certain foods may increase your risk of heart disease, changing your eating habits is usually difficult. Either you've been eating unhealthy for years or you just want to adjust your diet's blonds. Once you know what food you have to eat more and what you have to limit, you'll be on the way to a healthy diet for the heart. You're in time to make a big change.",

            "calories": "Calories",
            "cpm": "Click here for more",
            "greixos": "Fats",
            "gt": "Total fat",
            "hidrats": "Carbs",
            "hdc": "Total Carbohydrate",
            "proteïnes": "Protein",
            "sucre": "Sugar",
            "sodi": "Sodium",
            "fibra": "Fiber",
            "energia": "Energy",
            "dqs": "Of which, sugars",
            "inp": "Nutrition facts per",
            "grams": "grams",
            "porcio": "serving/s",

            "mi": "My information",
            "nl": "Name and surname",
            "ce": "Email",
            "dni": "ID number",
            "telefon": "Telephone",
            "dcpp": "Full address (street, floor and door)",
            "desar": "Save changes",
            "cancelar": "Cancel",
            "idiomafav": "Preferred language",
            "reset": "Reset password",
            "reset2": "Password",
            "df": "Set your eating goal",
            "nivellactivitat": "Current activity level",
            "objectiu": "Goal",
            "consumir": "Consume",
            "altura": "Height (cm)",
            "peso": "Weight (kg)",
            "edad": "Age",
            "sexo": "Gender",
            "home": "Male",
            "dona": "Female",
            "finalcalories": "To reach your goal, your daily calorie intake should be ",

            "nullaltura": "You must specify your height",
            "nullpes": "You must specify your weight",
            "nulledat": "You must specify your age",
            "nullsexe": "You must specify your gender",

            "faltendades": "Fill all the fields above to see your calories recomendation",

            "menjar1": "Breakfast",
            "menjar2": "Lunch",
            "menjar3": "Snacks",
            "menjar4": "Dinner",

            "recomanades": "recommended",
            "consumides": "eaten",
            "restants": "left",
            "sub1": "calorie intake",
            "afegint": "Adding",
            "quantitat": "Amount",

            "rlc": "Fill the fields following the instructions",
            "auna": "Suggest a new food for our database",
            "politica": "All suggested foods will be reviewed by one of our administrators. He will analyze the data and decide whether to add it to the database. He may also make changes to the information received if necessary. If the food is decided to be added to the database, it will be visible to all users.",
            "dai": "Indicate the name of the food in the three requested languages. Ex: Pechuga de pollo, Pit de pollastre, Chicken Breast, Chicken Breast. If the food is in a specific language or does not need to be translated, fill in all three fields with the same name, or as you find appropriate.",
            "es": "Spanish",
            "ca": "Catalan",
            "en": "English",
            "inc100g": "Specify the amount (grams) of every nutrient per 100 grams of product, leaving unknown fields empty. If the values contain decimals, use the dot instead of the comma.",
            "imatgepng": "You can upload an image (preferably without background or PNG), or specify an internet URL. Our administrators will upload it to the database",
            "url": "Specify an URL",
            "subir": "Upload your photo",
            "gp": "Serving size (grams). Leave blank if unknown or unnecessary",
            "imgaliment": "Image of the food",
            "debsed": "leave empty if unknown",
            "wit": "What is this?",
            "marcarestaurant": "Brand/Restaurant (Optional)",
            "ns": "Not specified",
            "enviarproposta": "Send request",
            "tipusaliment": "Type of food",
            "gptc": "Thank you for your collaboration",
            "serarevisat": "Your contribution will be reviewed by our administrators before being added to the database if it seems correct to us. With your help we can create a larger database and form a more complete application.",
            "hoa": "Submit another contribution",
            "contribuidor": "Write your name if you want to appear as a contributor of the database",
            "inseritper": "The data about this food was contributed by",
            "sensecontribuidor": "This food was created by an administrator",
            "pdc": "Control Panel",
            "nomaliment": "Food name",
            "fotografia": "Image",
            "gramsporcio": "Serving",
            "aprovaraliment": "Approve",
            "reprovaraliment": "Deny",
            "contribuidor": "Contributor",
            "titulopanel": "Welcome to the control panel",
            "descripcionpanel": "In this panel you can see the new food requests suggested by users. You can approve the requests that you see as correct, deny those that are not, and modify those that you see as necessary. You can also modify existing food data in the database if there is an error or a food needs to be deleted.",
            "marcarestaurantC": "Brand/Restaurant",
            "nhhc": "There are no new requests waiting for approval right now, come back later",
            "etpshm": "Your profile has been modified",
            "canvisguardats": "Changes saved",
            "sesini": "Logged in successfully",
            "volsinises": "Do you want to log in now?",
            "registrefet": "You have been registered successfully",
            "notnow": "Not now",
            "ytkmh": "Yes, take me there!",
            "duplicateemail1": "Could not register",
            "duplicateemail2": "An user with this email already exists",
            "nshpis": "We are sorry, could not log in :(",
            "upfail": "Check if the user and password are correct",
            "hola": "Welcome back!",
            "errordesconegut": "Unknown error",
            "torniaintentarho": "Try again",
            "espera1m": "Wait a minute!",
            "estassegur": "Are you sure you want to log out?",
            "si": "Yes, log out",
            "no": "No, stay logged in",
            "cua": "Search a food...",
            "objectiu_noes1": "You haven't set an eating goal yet",
            "objectiu_noes2": "Set yout goal in the profile section",
            "nspaea": "Could not register the food",
            "npadaamm": "You can not save the same food in the same meal of a day",
            "thp": "That is too much!",
            "hcmcdlc": "You have eaten too many calories today",
            "dadespersonals": "Personal data",
            "alimentsfavorits": "Favorite foods",
            "receptes": "Saved recipes",
            "eliminardf": "Remove from favorites",
            "notensfavs": "You don't have any favorite foods! When you have, they will appear here.",
            "marcaaliment": "Brand",
            "favs": "Favorite",
            "save": "Save",
            "aaf": "Add to favourites",
            "edf": "Remove from favourites",
            "enis": "It is necessary to log in to do this action",
            "sehaafegit": "You have added",
            "aetaf": "to your favorite foods",
            "uuuaaa": "You can see all your favorite foods at Profile > Favorite foods",
            "denegarsolicitud1": "Are you sure you want to deny this petition?",
            "denegarsolicitud2": "The data introduced by the contributor will be lost",
            "eliminaraliment1": "Are you sure you want to delete this food?",
            "eliminaraliment2": "The data about the food will be removed from the database",
            "modificardadesaliment1": "Do you want to save changes?",
            "modificardadesaliment2": "The modifications will be saved into the database",
            "siadelante": "Yes, go ahead",
            "sidenegar": "Yes, deny the data",
            "nodenegar": "No, wait",
            "sieliminar": "Yes, delete the food",
            "noeliminar": "No, wait",
            "aceptarsolicitud1": "Are you sure you want to accept the petition?",
            "aceptarsolicitud2": "The data about the food will be available to all users",
            "siaceptar": "Yes, accept the petition",
            "noaceptar": "No, wait",
            "llistataliments": "Food list",
            "descllistaaliments": "Welcome to the list of all our foods. Here you can apply different filters to our list, such as seeing foods of a specific type or ordering from highest to lowest according to some nutrient",
            "filtrealfabet": "Sort alphabetically",
            "filtrealfabetcontrari": "Sort alphabetically reverse",
            "filtretipus": "Filter by type of food",
            "filtrerestaurant": "Filter by brand or restaurant",
            "filtrecalories": "Filter by calories",
            "filtregreixos": "Filter by fat",
            "filtrehidrats": "Filter by carbs",
            "filtreproteines": "Filter by protein",
            "demajoramenor": "Higher to lower",
            "demenoramajor": "Lower to higher",
            "lainfoesper100g": "* The filters refer to the nutritional information for every 100 grams of product",
            "receptavacia": "This recipe has no foods",
            "quisom": "Who are we?",
            "paragrafQuiSom": "Somos dos jóvenes alumnos del Pau Casesnoves CIFP, estudiantes de Desarrollo de Aplicaciones Web, que estamos realizando nuestro proyecto final para el curso 2021-2022. Actualmente, estamos haciendo las prácticas en la empresa Gamadi Consulting Balears S.L. en Palma de Mallorca. Tenemos grandes aspiraciones de cara al futuro y muchas ganas de comenzar a trabajar en el mundo del desarrollo web.",
            "afegiraliment": "Add tood to recipe",
            "crearnovarecepta": "Create a new recipe",
            "nomrecepta": "Name of the recipe",
            "descripciorecepta": "Description of the recipe",
            "imatgerepresentativarecepta": "Representative image of the recipe",
            "confnuerec": "Confirm new recipe",
            "eliminarrecepta": "Delete recipe",
            "estassegur2": "Are you sure you want to delete the recipe?",
            "sieliminarreceta": "Yes, delete the recipe",
            "afegiradiari": "Add to my diary",
            "recetagefida1": "You have added ",
            "recetagefida2": " to your diary",
            "infoproteines": "Proteins play a fundamental role in the body. They are essential for growth, thanks to their nitrogen content and account for approximately half the weight of the body's tissues, being present in all the cells of the body, in addition to participating in practically all the biological processes that occur. They are present mainly in foods of animal origin such as meat, fish, eggs and milk. But they are also found in plant foods, such as soybeans, legumes and cereals, although to a lesser extent. Its intake provides the body with 4 kilocalories for each gram of protein.",
            "infohidrats": "Carbohydrates, also called carbohydrates, are the sugars, starches, and fibers found in a wide variety of foods such as fruits, grains, vegetables, and dairy products. They are called carbohydrates, since at the chemical level they contain carbon, hydrogen and oxygen. They are one of the basic food groups and are important for a healthy life, as they are macronutrients, which means that they are one of the three main forms of substances that the human body uses for energy or calories. All macronutrients must be obtained from the diet, as the body cannot produce them on its own.",
            "infogreixos": "Fats are a type of nutrient that you get from food. It is essential to eat some fat, although it is also harmful to eat too much. The fats we eat give the body the energy it needs to work properly. During exercise, the body uses the calories from the carbohydrates that we have consumed. But after 20 minutes, exercise relies in part on calories from fat to keep going. We also need fat to keep our skin and hair healthy. Foods rich in healthy fats are extra virgin olive oil, avocado, oily fish, nuts, among many others. Don't forget to include healthy fats in your diet!",
            "socialmedia": "Social Media",
            "tornaraintentar": "Try again",
            "perfildawid1": "Born in Kłodzko, Poland, on October 8, 2002, he is a young programmer experienced in React, Laravel and Javascript. In his free time he likes to do physical activity and watch football, whenever he is not programming. He is currently studying a higher degree in web application development at the CIFP Pau Casesnoves in Inca, Mallorca.",
            "eliminaraliment": "Delete",
            "editaraliment": "Save",
            "adelbdd": "Foods available in the database",
            "sdlupa": "User requests",
            "tsdaea": "Do you know what do these have in common?",
            "alimentsferro": "All of them are foods rich in iron, which is among the most important elements for the proper functioning of our body. This mineral fulfills two essential jobs: helping oxygen to travel through the body and helping to ensure that there is always a good production of red blood cells. They are very important in the supply of oxygen to all our cells. It is necessary to know then which foods are rich in iron. Thus, they can be included in the diet until reaching the recommended 18 milligrams per day. Iron-rich foods are pistachios, spinach, almonds, oatmeal, chocolate, eggs, broccoli, almonds.",
            "loading": "Loading, please wait...",
            "queteapetece": "What do you fancy eating?",
            "notienescuenta": "You don't have an account?",
            "registrate": "Register now",
            "arrowup": "Return to the filtres",
            "hhueiea": "There was an error",
            "varlcdf": "Check the fields again",
            "perfilmateu1": "Born in Palma de Mallorca, on April 23, 2002, he is a boy with motivation for what awaits him throughout his life. He has a great ability to design web page styles. Apart from programming, he is also passionate about sports such as basketball or the gym. In his free time he likes to be in nature, hiking in the mountains or in the countryside.",
            "calroies10dies": "Calories consumed in the last recorded 10 days"
        }
    ]
}